RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_1xxxx_FWLib/library/HT32F1xxxx_Driver/src/ht32f1xxxx_tm.c
/*********************************************************************************************************//**
 * @file    ht32f1xxxx_tm.c
 * @version $Rev:: 2973         $
 * @date    $Date:: 2023-10-30 #$
 * @brief   This file provides all the TM firmware functions.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32f1xxxx_tm.h"

/** @addtogroup HT32F1xxxx_Peripheral_Driver HT32F1xxxx Peripheral Driver
  * @{
  */

/** @defgroup TM TM
  * @brief TM driver modules
  * @{
  */


/* Private constants ---------------------------------------------------------------------------------------*/
/** @defgroup TM_Private_Define TM private definitions
  * @{
  */
#define CNTCFR_UEVDIS       0x00000001ul
#define CNTCFR_UGDIS        0x00000002ul
#define CNTCFR_DIR          0x01000000ul
#define CNTCFR_CMSEL_MASK   ~0x00030000ul
#define CNTCFR_CKDIV_MASK   ~0x00000300ul

#define MDCFR_SPMSET        0x01000000ul
#define MDCFR_TSE           0x00000001ul
#define MDCFR_SMSEL_MASK    ~0x00000700ul
#define MDCFR_MMSEL_MASK    ~0x00070000ul

#define TRCFR_ECME          0x01000000ul
#define TRCFR_ETI_POL       0x00010000ul
#define TRCFR_ETI_PSC_MASK  ~0x00003000ul
#define TRCFR_ETIF_MASK     ~0x00000F00ul
#define TRCFR_TRSEL_MASK    ~0x0000000Ful
#define TRCFR_ETI_CONF_MASK ~0x00013F00ul

#define CTR_TME             0x00000001ul
#define CTR_CRBE            0x00000002ul
#define CTR_CHCCDS          0x00010000ul

#define CH0ICFR_CH0SRC      0x80000000ul
#define CHICFR_CHF_MASK     ~0x0000000Ful
#define CHICFR_CHCCS_MASK   ~0x00030000ul
#define CHICFR_CHPSC_MASK   ~0x000C0000ul

#define CHOCFR_REFCE        0x00000008ul
#define CHOCFR_CHPRE        0x00000010ul
#define CHOCFR_IMAE         0x00000020ul
#define CHOCFR_CHOM_MASK    ~0x00000107ul

#define CHPOLR_CH0P         0x00000001ul
#define CHPOLR_CH1P         0x00000004ul
/**
  * @}
  */

/* Private function prototypes -----------------------------------------------------------------------------*/
static void _TM_CHx_Config(HT_TM_TypeDef* TMx, TM_CH_Enum Ch, TM_CHP_Enum Pol, TM_CHCCS_Enum Sel, u8 Filter);

/* Global functions ----------------------------------------------------------------------------------------*/
/** @defgroup TM_Exported_Functions TM exported functions
  * @{
  */
/*********************************************************************************************************//**
 * @brief Deinitialize the TMx peripheral registers to their default reset values.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @retval None
 ************************************************************************************************************/
void TM_DeInit(HT_TM_TypeDef* TMx)
{
  RSTCU_PeripReset_TypeDef RSTCUReset = {{0}};

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));

  if (TMx == HT_GPTM0)
  {
    RSTCUReset.Bit.GPTM0 = 1;
  }
  #if (!LIBCFG_NO_GPTM1)
  else if (TMx == HT_GPTM1)
  {
    RSTCUReset.Bit.GPTM1 = 1;
  }
  #endif
  #if (!LIBCFG_NO_MCTM0)
  else if (TMx == HT_MCTM0)
  {
    RSTCUReset.Bit.MCTM0 = 1;
  }
  #endif
  #if (!LIBCFG_NO_MCTM1)
  else if (TMx == HT_MCTM1)
  {
    RSTCUReset.Bit.MCTM1 = 1;
  }
  #endif
  #if (LIBCFG_PWM0)
  else if (TMx == HT_PWM0)
  {
    RSTCUReset.Bit.PWM0 = 1;
  }
  #endif
  #if (LIBCFG_SCTM0)
  else if (TMx == HT_SCTM0)
  {
    RSTCUReset.Bit.SCTM0 = 1;
  }
  #endif
  #if (LIBCFG_SCTM1)
  else if (TMx == HT_SCTM1)
  {
    RSTCUReset.Bit.SCTM1 = 1;
  }
  #endif

  RSTCU_PeripReset(RSTCUReset, ENABLE);
}

/*********************************************************************************************************//**
 * @brief Initialize the TMx counter to reload, prescaler, counter mode and repetition counter.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param TimeBaseInit: Point to a \ref TM_TimeBaseInitTypeDef that contains the configuration information.
 * @retval None
 ************************************************************************************************************/
void TM_TimeBaseInit(HT_TM_TypeDef* TMx, TM_TimeBaseInitTypeDef* TimeBaseInit)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_CNT_MODE(TimeBaseInit->CounterMode));
  Assert_Param(IS_TM_PSC_RLD(TimeBaseInit->PSCReloadTime));

  /* Set the counter reload value                                                                           */
  TMx->CRR = TimeBaseInit->CounterReload;

  /* Set the Prescaler value                                                                                */
  TMx->PSCR = TimeBaseInit->Prescaler;

  /* Select the Counter Mode                                                                                */
  TMx->CNTCFR &= CNTCFR_CMSEL_MASK;        /* CNTCFR_DIR is read only when the timer configured as          */
  TMx->CNTCFR &= ~(u32)CNTCFR_DIR;         /* Center-aligned mode. Reset mode first and then reset the      */
                                           /* CNTCFR_DIR bit (separate as two steps).                       */

