RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_1xxxx_FWLib/library/HT32F1xxxx_Driver/src/ht32f1xxxx_tm.c
  TMx->CNTCFR |= TimeBaseInit->CounterMode;

  #if (!LIBCFG_NO_MCTM0)
  if ((TMx == HT_MCTM0) || (TMx == HT_MCTM1))
  {
    /* Set the Repetition value                                                                             */
    TMx->REPR = TimeBaseInit->RepetitionCounter;
  }
  #endif

  /* To reload the Prescaler value immediatly or next update event                                          */
  TMx->EVGR = TimeBaseInit->PSCReloadTime;
}

/*********************************************************************************************************//**
 * @brief Initialize the TMx channel N output.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param OutInit: Point to a \ref TM_OutputInitTypeDef structure that contains
                   the configuration information.
 * @retval None
 ************************************************************************************************************/
void TM_OutputInit(HT_TM_TypeDef* TMx, TM_OutputInitTypeDef* OutInit)
{
  vu32 *pOcfr = (vu32*)&TMx->CH0OCFR + OutInit->Channel;
  vu32 *pCcr = (vu32*)&TMx->CH0CCR + OutInit->Channel;
  vu32 *pAcr = (vu32*)&TMx->CH0ACR + OutInit->Channel;
  u8 bChPos = OutInit->Channel << 1;
  u32 wTmpMask;
  u32 wTmpReg;
  u32 uIsMCTM = 0;

  #if (!LIBCFG_NO_MCTM0)
  if ((TMx == HT_MCTM0) || (TMx == HT_MCTM1))
  {
    uIsMCTM = 1;
  }
  #endif
  if (uIsMCTM)
  {
    wTmpMask = ~(0x3ul << bChPos);
  }
  else
  {
    wTmpMask = ~(0x1ul << bChPos);
  }

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_CH(OutInit->Channel));
  Assert_Param(IS_TM_OM(OutInit->OutputMode));
  Assert_Param(IS_TM_CHCTL(OutInit->Control));
  Assert_Param(IS_TM_CHP(OutInit->Polarity));

  #if (!LIBCFG_NO_MCTM0)
  if (uIsMCTM)
  {
    Assert_Param(IS_TM_CHCTL(OutInit->ControlN));
    Assert_Param(IS_TM_CHP(OutInit->PolarityN));
    Assert_Param(IS_MCTM_OIS(OutInit->IdleState));
    Assert_Param(IS_MCTM_OIS(OutInit->IdleStateN));
  }
  #endif


  /* Disable the Channel                                                                                    */
  TMx->CHCTR &= wTmpMask;

  /* Set the Output Compare Polarity                                                                        */
  wTmpReg = TMx->CHPOLR & wTmpMask;

  if (uIsMCTM)
  {
    wTmpReg |= (u32)(OutInit->Polarity | (OutInit->PolarityN << 1)) << bChPos;
  }
  else
  {
    wTmpReg |= (u32)(OutInit->Polarity) << bChPos;
  }

  TMx->CHPOLR = wTmpReg;

  /* Set the Output Idle State                                                                              */
  if (uIsMCTM)
  {
    wTmpReg = TMx->CHBRKCFR & wTmpMask;
    wTmpReg |= (u32)(OutInit->IdleState | (OutInit->IdleStateN << 1)) << bChPos;
    TMx->CHBRKCFR = wTmpReg;
  }

  /* Select the Output Compare Mode                                                                         */
  *pOcfr &= CHOCFR_CHOM_MASK;
  *pOcfr |= OutInit->OutputMode;

  /* Set the Capture Compare Register value                                                                 */
  *pCcr = OutInit->Compare;

  /* Set the Asymmetric Compare Register value                                                              */
  *pAcr = OutInit->AsymmetricCompare;

  /* Set the channel state                                                                                  */
  if (uIsMCTM)
  {
    TMx->CHCTR |= (u32)(OutInit->Control | (OutInit->ControlN << 1)) << bChPos;
  }
  else
  {
    TMx->CHCTR |= (u32)(OutInit->Control) << bChPos;
  }
}

/*********************************************************************************************************//**
 * @brief Initialize input capture of the TMx channel.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param CapInit: Point to a \ref TM_CaptureInitTypeDef structure that contains the configuration
 *                information.
 * @retval None
 ************************************************************************************************************/
void TM_CaptureInit(HT_TM_TypeDef* TMx, TM_CaptureInitTypeDef* CapInit)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_CH(CapInit->Channel));
  Assert_Param(IS_TM_CHP(CapInit->Polarity));
  Assert_Param(IS_TM_CHCCS(CapInit->Selection));
  Assert_Param(IS_TM_CHPSC(CapInit->Prescaler));
  Assert_Param(IS_TM_FILTER(CapInit->Filter));

  _TM_CHx_Config(TMx, CapInit->Channel, CapInit->Polarity, CapInit->Selection, CapInit->Filter);

  /* Set the Input Capture Prescaler value                                                                  */
  TM_CHPSCConfig(TMx, CapInit->Channel, CapInit->Prescaler);
}

/*********************************************************************************************************//**
 * @brief Configure the TMx to measure an external PWM signal.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param CapInit: Point to a \ref TM_CaptureInitTypeDef structure that contains the configuration
 *                information.
 * @retval None
 ************************************************************************************************************/
void TM_PwmInputInit(HT_TM_TypeDef* TMx, TM_CaptureInitTypeDef* CapInit)
{
  TM_CHP_Enum OppositePol;
  TM_CHCCS_Enum OppositeSel;
  TM_CH_Enum OppositeChannel;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_CH_PWMI(CapInit->Channel));
  Assert_Param(IS_TM_CHP(CapInit->Polarity));
  Assert_Param(IS_TM_CHCCS(CapInit->Selection));
  Assert_Param(IS_TM_CHPSC(CapInit->Prescaler));
  Assert_Param(IS_TM_FILTER(CapInit->Filter));

  /* Select the Opposite Input Polarity                                                                     */
  if (CapInit->Polarity == TM_CHP_NONINVERTED)
  {
    OppositePol = TM_CHP_INVERTED;
  }
  else
  {
    OppositePol = TM_CHP_NONINVERTED;
  }

