RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_1xxxx_FWLib/library/HT32F1xxxx_Driver/src/ht32f1xxxx_tm.c
/*********************************************************************************************************//**
 * @brief Configure external clock mode of the TMx. Used ETI as the clock source.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param Psc: The external Trigger Prescaler.
 *        It can be one of the following values:
 *        @arg TM_ETIPSC_OFF : ETI prescaler off
 *        @arg TM_ETIPSC_2   : ETIP frequency divided by 2
 *        @arg TM_ETIPSC_4   : ETIP frequency divided by 4
 *        @arg TM_ETIPSC_8   : ETIP frequency divided by 8
 * @param Pol: The external trigger input polarity.
 *        It can be one of the following values:
 *        @arg TM_ETIPOL_NONINVERTED : Active high level or rising edge
 *        @arg TM_ETIPOL_INVERTED    : Active low level or falling edge
 * @param Filter: Filter for ETI input.
 *        This parameter must be a value between 0x00 and 0x0F
 * @retval None
 ************************************************************************************************************/
void TM_EtiExternalClockConfig(HT_TM_TypeDef* TMx, TM_ETIPSC_Enum Psc, TM_ETIPOL_Enum Pol, u8 Filter)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_ETIPSC(Psc));
  Assert_Param(IS_TM_ETIPOL(Pol));
  Assert_Param(IS_TM_FILTER(Filter));

  /* Configure the ETI Clock source                                                                         */
  TM_EtiConfig(TMx, Psc, Pol, Filter);

  /* Enable the external clock mode                                                                         */
  TMx->TRCFR |= TRCFR_ECME;
}

/*********************************************************************************************************//**
 * @brief Configure external trigger input (ETI) of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param Psc: The external Trigger Prescaler.
 *        It can be one of the following values:
 *        @arg TM_ETIPSC_OFF : ETI prescaler off
 *        @arg TM_ETIPSC_2   : ETIP frequency divided by 2
 *        @arg TM_ETIPSC_4   : ETIP frequency divided by 4
 *        @arg TM_ETIPSC_8   : ETIP frequency divided by 8
 * @param Pol: The external trigger input polarity.
 *        It can be one of the following values:
 *        @arg TM_ETIPOL_NONINVERTED : Active high level or rising edge
 *        @arg TM_ETIPOL_INVERTED    : Active low level or falling edge
 * @param Filter: Filter for ETI input.
 *        This parameter must be a value between 0x00 and 0x0F
 * @retval None
 ************************************************************************************************************/
void TM_EtiConfig(HT_TM_TypeDef* TMx, TM_ETIPSC_Enum Psc, TM_ETIPOL_Enum Pol, u8 Filter)
{
  u32 wTrcfr;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_ETIPSC(Psc));
  Assert_Param(IS_TM_ETIPOL(Pol));
  Assert_Param(IS_TM_FILTER(Filter));

  /* Get TRCFR value with cleared ETI configuration bits                                                    */
  wTrcfr = TMx->TRCFR & TRCFR_ETI_CONF_MASK;

  /* Set the prescaler, filter and polarity for ETI input                                                   */
  wTrcfr |= (u32)Psc | Pol | ((u32)Filter << 8);

  /* Write to TMx TRCFR                                                                                     */
  TMx->TRCFR = wTrcfr;
}

/*********************************************************************************************************//**
 * @brief Configure prescaler of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param Psc: Specify the prescaler value.
 * @param PscReloadTime: Specify the TM prescaler reload time.
 *        This parameter can be one of the following values:
 *        @arg TM_PSC_RLD_UPDATE    : The prescaler is loaded at the next update event.
 *        @arg TM_PSC_RLD_IMMEDIATE : The prescaler is loaded immediatly.
 * @retval None
 ************************************************************************************************************/
void TM_PrescalerConfig(HT_TM_TypeDef* TMx, u16 Psc, TM_PSC_RLD_Enum PscReloadTime)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_PSC_RLD(PscReloadTime));

  /* Set the prescaler value                                                                                */
  TMx->PSCR = Psc;

  /* Set the UEVG bit or not                                                                                */
  TMx->EVGR = PscReloadTime;
}

/*********************************************************************************************************//**
 * @brief Configure counter mode of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param Mod: Specify the counter mode to be used.
 *        This parameter can be one of the following values:
 *        @arg TM_CNT_MODE_UP   : TM up counting mode.
 *        @arg TM_CNT_MODE_DOWN : TM down counting mode.
 *        @arg TM_CNT_MODE_CA1  : TM center aligned mode 1.
 *        @arg TM_CNT_MODE_CA2  : TM center aligned mode 2.
 *        @arg TM_CNT_MODE_CA3  : TM center aligned mode 3.
 * @retval None
 ************************************************************************************************************/
void TM_CounterModeConfig(HT_TM_TypeDef* TMx, TM_CNT_MODE_Enum Mod)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_CNT_MODE(Mod));

  /* Reset the CMSEL and DIR Bits                                                                           */
  TMx->CNTCFR &= CNTCFR_CMSEL_MASK;        /* CNTCFR_DIR is read only when the timer configured as          */
  TMx->CNTCFR &= ~(u32)CNTCFR_DIR;         /* Center-aligned mode. Reset mode first and then reset the      */
                                           /* CNTCFR_DIR bit (separate as two steps).                       */

  /* Set the Counter Mode                                                                                   */
  TMx->CNTCFR |= Mod;
}

