RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_1xxxx_FWLib/library/HT32F1xxxx_Driver/src/ht32f1xxxx_tm.c
/*********************************************************************************************************//**
 * @brief Select the STI source.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param Sel: Specify the STI source.
 *        This parameter can be one of the following:
 *        @arg TM_TRSEL_ITI0  : Internal trigger 0.
 *        @arg TM_TRSEL_ITI1  : Internal trigger 1.
 *        @arg TM_TRSEL_ITI2  : Internal trigger 2.
 *        @arg TM_TRSEL_TI0BED : TI0 both edge detector.
 *        @arg TM_TRSEL_TI0S0 : Filtered channel 0 input.
 *        @arg TM_TRSEL_TI1S1 : Filtered channel 1 input.
 *        @arg TM_TRSEL_ETIF  : External trigger input.
 *        @arg TM_TRSEL_UEVG  : Trigger by setting UEVG bit.
 * @retval None
 ************************************************************************************************************/
void TM_StiConfig(HT_TM_TypeDef* TMx, TM_TRSEL_Enum Sel)
{
  u32 wTrcfr;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_TRSEL(Sel));

  /* Disable slave mode                                                                                     */
  TMx->MDCFR &= MDCFR_SMSEL_MASK;

  /* Get the TRCFR value with cleared TRSEL                                                                 */
  wTrcfr = TMx->TRCFR & TRCFR_TRSEL_MASK;

  /* Set the STI source                                                                                     */
  TMx->TRCFR |= wTrcfr | Sel;
}

/*********************************************************************************************************//**
 * @brief Configure encoder interface of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param DecoderMod: Specify the TMx decoder mode.
 *        This parameter can be one of the following values:
 *        @arg TM_SMSEL_DECODER1 : Counter counts on CH0 edge depending on CH1 level.
 *        @arg TM_SMSEL_DECODER2 : Counter counts on CH1 edge depending on CH0 level.
 *        @arg TM_SMSEL_DECODER3 : Counter counts on both CH0 and CH1 edges depending on
 *             the level of the other input.
 * @param CH0P: Specify the CH0 polarity.
 *        This parameter can be one of the following values:
 *        @arg TM_CHP_NONINVERTED : Active high level or rising edge
 *        @arg TM_CHP_INVERTED    : Active low level or falling edge
 * @param CH1P: Specify the CH1 polarity.
 *        This parameter can be one of the following values:
 *        @arg TM_CHP_NONINVERTED : Active high level or rising edge
 *        @arg TM_CHP_INVERTED    : Active low level or falling edge
 * @retval None
 ************************************************************************************************************/
void TM_DecoderConfig(HT_TM_TypeDef* TMx, TM_SMSEL_Enum DecoderMod, TM_CHP_Enum CH0P, TM_CHP_Enum CH1P)
{
  u32 wMdcfr, wCh0Icfr, wCh1Icfr, wChpolr;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_SMSEL_DECODER(DecoderMod));
  Assert_Param(IS_TM_CHP(CH0P));
  Assert_Param(IS_TM_CHP(CH1P));

  /* Get the TMx MDCFR register value                                                                       */
  wMdcfr = TMx->MDCFR;

  /* Get the TMx CH0ICFR & CH1ICFR register value                                                           */
  wCh0Icfr = TMx->CH0ICFR;
  wCh1Icfr = TMx->CH1ICFR;

  /* Get the TMx CHPOLR register value                                                                      */
  wChpolr = TMx->CHPOLR;

  /* Set the decoder mode                                                                                   */
  wMdcfr &= MDCFR_SMSEL_MASK;
  wMdcfr |= DecoderMod;

  /* Select the channel 0 and the channel 1 as input and clear CH0SRC                                       */
  wCh0Icfr &= CHICFR_CHCCS_MASK & (~CH0ICFR_CH0SRC);
  wCh1Icfr &= CHICFR_CHCCS_MASK;
  wCh0Icfr |= TM_CHCCS_DIRECT;
  wCh1Icfr |= TM_CHCCS_DIRECT;

  /* Set the CH0 and the CH1 polarities                                                                     */
  wChpolr &= ~(CHPOLR_CH0P | CHPOLR_CH1P);
  wChpolr |= (CH0P | (CH1P << 2));

  /* Write to TMx MDCFR                                                                                     */
  TMx->MDCFR = wMdcfr;

  /* Write to TMx CH0ICFR & CH1ICFR                                                                         */
  TMx->CH0ICFR = wCh0Icfr;
  TMx->CH1ICFR = wCh1Icfr;

  /* Write to TMx CHPOLR                                                                                    */
  TMx->CHPOLR = wChpolr;
}

/*********************************************************************************************************//**
 * @brief Force the TMx CHnOREF waveform to active or inactive level.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param TM_CH_n: Specify the TM channel.
 *        This parameter can be one of the following values:
 *        @arg TM_CH_0 : TM channel 0
 *        @arg TM_CH_1 : TM channel 1
 *        @arg TM_CH_2 : TM channel 2
 *        @arg TM_CH_3 : TM channel 3
 * @param ForcedAction: Specify the forced action to be set to the output waveform.
 *        This parameter can be one of the following values:
 *        @arg TM_OM_FORCED_ACTIVE   : Forced active level on CH0OREF
 *        @arg TM_OM_FORCED_INACTIVE : Forced inactive level on CH0OREF.
 * @retval None
 ************************************************************************************************************/
void TM_ForcedOREF(HT_TM_TypeDef* TMx, TM_CH_Enum TM_CH_n, TM_OM_Enum ForcedAction)
{
  vu32* pCHnOCFR = ((vu32*)&TMx->CH0OCFR) + (TM_CH_n * 1);

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_CH(TM_CH_n));
  Assert_Param(IS_TM_OM_FORCED(ForcedAction));

