RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_1xxxx_FWLib/library/HT32F1xxxx_Driver/src/ht32f1xxxx_tm.c
/*********************************************************************************************************//**
 * @brief Enable or Disable the specified PDMA requests of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param TM_PDMA: Specify the TM PDMA requests to be enabled or disabled.
 *        This parameter can be any combination of the following values:
 *        @arg TM_PDMA_CH0CC     : TM Capture/compare 0 PDMA request
 *        @arg TM_PDMA_CH1CC     : TM Capture/compare 1 PDMA request
 *        @arg TM_PDMA_CH2CC     : TM Capture/compare 2 PDMA request
 *        @arg TM_PDMA_CH3CC     : TM Capture/compare 3 PDMA request
 *        @arg TM_PDMA_UEV       : TM update PDMA request
 *        @arg TM_PDMA_UEV2      : TM update 2 PDMA request
 *        @arg TM_PDMA_TEV       : TM trigger PDMA request
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void TM_PDMAConfig(HT_TM_TypeDef* TMx, u32 TM_PDMA, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_PDMA(TM_PDMA));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the PDMA request                                                                              */
    TMx->DICTR |= TM_PDMA;
  }
  else
  {
    /* Disable the PDMA request                                                                             */
    TMx->DICTR &= ~TM_PDMA;
  }
}
/**
  * @}
  */

/* Private functions ---------------------------------------------------------------------------------------*/
/** @defgroup TM_Private_Functions TM private functions
  * @{
  */
/*********************************************************************************************************//**
 * @brief Configure the CHx as input.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param Ch: Specify the TM Channel.
 *        This parameter can be one of the following values:
 *        @arg TM_CH_0 : TM channel 0
 *        @arg TM_CH_1 : TM channel 1
 *        @arg TM_CH_2 : TM channel 2
 *        @arg TM_CH_3 : TM channel 3
 * @param Pol: The input polarity.
 *        This parameter can be one of the following values:
 *        @arg TM_CHP_NONINVERTED : Active high level or rising edge
 *        @arg TM_CHP_INVERTED    : Active low level or falling edge
 * @param Sel: Specify the input to be used.
 *        This parameter can be one of the following values:
 *        @arg TM_CHCCS_DIRECT   : TM CHxI is mapped on CHx.
 *        @arg TM_CHCCS_INDIRECT : TM CH1I is mapped on CH0 (or CH0I->CH1 or CH2I->CH3 or CH3I->CH2).
 *        @arg TM_CHCCS_TRCED    : TM CHx is mapped on TRC.
 * @param Filter: Specify the input capture filter.
 *        This parameter must be a value between 0x00 and 0x0F.
 * @retval None
 ************************************************************************************************************/
static void _TM_CHx_Config(HT_TM_TypeDef* TMx, TM_CH_Enum Ch, TM_CHP_Enum Pol, TM_CHCCS_Enum Sel, u8 Filter)
{
  vu32* pIcfr = (vu32*)&TMx->CH0ICFR + Ch;
  u32 wIcfr, wChpolr;

  /* Disable the channel N: reset the CHxE bit                                                              */
  TMx->CHCTR &= ~((u32)0x1 << (Ch << 1));

  wIcfr = *pIcfr;
  wChpolr = TMx->CHPOLR;

  /* Select the input and set the filter                                                                    */
  wIcfr &= CHICFR_CHCCS_MASK & CHICFR_CHF_MASK;
  wIcfr |= Sel | Filter;
  *pIcfr = wIcfr;

  /* Select the polarity bit                                                                                */
  wChpolr &= ~((u32)0x1 << (Ch << 1));
  wChpolr |= (u32)Pol << (Ch << 1);
  TMx->CHPOLR = wChpolr;

  /* Set the CHxE Bit                                                                                       */
  TMx->CHCTR |= (u32)0x1 << (Ch << 1);
}
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
